alchemy.org
#+SETUPFILE: ~/Code/Notes/main.orgsetup

# Export to HTML with:
#   C-c C-e h h     (org-html-export-to-html)
# Tangle with C-c C-x v t   (org-babel-tangle)
#   or with F6
* Programming Notes
:PROPERTIES:
:HTML_CONTAINER: header
:HTML_CONTAINER_CLASS: testing
:END:
  Code and Notes on things that interested me at least once.

#+BEGIN_HTML
<p class="view"><a href="https://github.com/tobytripp/programming-notes">View the Project on GitHub <small>tobytripp/programming-notes</small></a></p>
#+END_HTML


* Skyrim Potion Mixing
:PROPERTIES:
:HTML_CONTAINER: section
:END:

** Prolog

   A general-purpose logic programming language developed in 1972.

   Abbreviation of "Programming with Logic"

      - implication =:-=
      - conjunction ,
      - disjunction =;=
      - variable    =Var=
      - atom        =var=
      - number      =2=

*** Atoms

    #+BEGIN_SRC prolog
      1.                              % numbers
      atom.                           % simple
      'an atom'.                      % quoted
    #+END_SRC

*** Variables
    Begin with an Upper-case letter.
    #+BEGIN_SRC prolog
      X.
      X1.
      C_3.
    #+END_SRC

*** Facts
    Facts can be considered to be Rules with no Body, i.e., a Rule
    whose antecedent conditions are empty and therefore always true.

    #+BEGIN_SRC prolog
      cat( sylvester ) :- true.    % also called a `complex term`
      cat( tom ).                  % synonymous with above

      dog( bill ).
      mouse( jerry ).
    #+END_SRC


*** Rules

    #+BEGIN_SRC prolog
      animal( X ) :- cat( X ).     % Given X is a cat,
                                   % X is an animal.
    #+END_SRC

*** Terms may be recursive

    Does this /unify/?

    #+BEGIN_SRC prolog
      % `=` is Prolog's unification operator.
      father(X)  =  X.
    #+END_SRC

    #+ATTR_REVEAL: :frag roll-in
    Yes, it does.

    #+ATTR_REVEAL: :frag roll-in
    To what?

    #+ATTR_REVEAL: :frag roll-in
    …it depends. The expression is defined to be unifiable, but its
    display is implementation-dependent. [fn:2]


    What is displayed will vary based on the prolog implementation, but
    any of them will allow the query to unify.

    SWI-Prolog will answer

    #+BEGIN_SRC prolog :tangle no
      X = father(X).
    #+END_SRC

    gprolog will refuse to output the unification, but will still
    return `yes`, indicating that the expression unified.

    Other implementations may try to display it as something like:

    #+BEGIN_SRC prolog :tangle no
       X  =  father(father(father(father(...))))))))
    #+END_SRC

*** Queries

    #+BEGIN_SRC prolog
      ?- cat( X ).
      X = sylvester
      X = tom
    #+END_SRC

*** Lists

    #+BEGIN_SRC prolog
    [1, 2, a].
    [1, a( 1, 2 ), 3].
    [A, b, c].

    | ?- [1,2,3] = [A|Tail].
    A = 1
    Tail = [2,3]

    | ?- [1,2,3] = [A|[B|Tail]].

    A = 1
    B = 2
    Tail = [3]
    #+END_SRC

*** Append
    Let's consider a definition of Prolog's append/3: [fn:2]
    #+BEGIN_SRC prolog
      append( [], L, L ).
      append( [H|T], L2, [H|L3] ) :- append( T, L2, L3 ).
    #+END_SRC

    Demonstrates the Head|Tail list deconstruction.

    Read as:
      appending the empty list to any list L results in the list L.

      when we append a non-empty list [H|T] with a list L2, we get
      the list whose head is H and
      whose tail is the result of appending T with L2 .


