alchemy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Code Alchemy</title>
<!-- 2015-02-22 Sun 12:26 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Toby Tripp" />
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.2/css/bootstrap.min.css">
<link rel="stylesheet" href="css/style.css">
</head>
<body>
<div id="content">
<h1 class="title">Code Alchemy</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Skyrim Potion Mixing</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Prolog</h3>
<div class="outline-text-3" id="text-1-1">
<p>
A general-purpose logic programming language developed in 1972.
</p>

<p>
Abbreviation of "Programming with Logic"
</p>

<ul class="org-ul">
<li>implication <code>:-</code>
</li>
<li>conjunction ,
</li>
<li>disjunction <code>;</code>
</li>
<li>variable    <code>Var</code>
</li>
<li>atom        <code>var</code>
</li>
<li>number      <code>2</code>
</li>
</ul>
</div>

<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1">Atoms</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">

<pre class="src src-prolog">1.                              <span style="color: #586e75;">% numbers</span>
atom.                           <span style="color: #586e75;">% simple</span>
<span style="color: #2aa198;">'an atom'</span>.                      <span style="color: #586e75;">% quoted</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2">Variables</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Begin with an Upper-case letter.
</p>
<div class="org-src-container">

<pre class="src src-prolog"><span style="color: #268bd2;">X</span>.
<span style="color: #268bd2;">X1</span>.
<span style="color: #268bd2;">C_3</span>.
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3">Facts</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
Facts can be considered to be Rules with no Body, i.e., a Rule
whose antecedent conditions are empty and therefore always true.
</p>

<div class="org-src-container">

<pre class="src src-prolog"><span style="color: #268bd2;">cat</span><span style="color: #f5deb3;">(</span> sylvester <span style="color: #f5deb3;">)</span> :- true.    <span style="color: #586e75;">% also called a `complex term`</span>
<span style="color: #268bd2;">cat</span><span style="color: #f5deb3;">(</span> tom <span style="color: #f5deb3;">)</span>.                  <span style="color: #586e75;">% synonymous with above</span>

<span style="color: #268bd2;">dog</span><span style="color: #f5deb3;">(</span> bill <span style="color: #f5deb3;">)</span>.
<span style="color: #268bd2;">mouse</span><span style="color: #f5deb3;">(</span> jerry <span style="color: #f5deb3;">)</span>.
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4">Rules</h4>
<div class="outline-text-4" id="text-1-1-4">
<div class="org-src-container">

<pre class="src src-prolog"><span style="color: #268bd2;">animal</span><span style="color: #f5deb3;">(</span> <span style="color: #268bd2;">X</span> <span style="color: #f5deb3;">)</span> :- cat<span style="color: #f5deb3;">(</span> <span style="color: #268bd2;">X</span> <span style="color: #f5deb3;">)</span>.     <span style="color: #586e75;">% Given X is a cat,</span>
                             <span style="color: #586e75;">% X is an animal.</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-5" class="outline-4">
<h4 id="sec-1-1-5">Terms may be recursive</h4>
<div class="outline-text-4" id="text-1-1-5">
<p>
Does this <i>unify</i>?
</p>

<div class="org-src-container">

<pre class="src src-prolog"><span style="color: #586e75;">% </span><span style="color: #586e75;">`=` is Prolog's unification operator.</span>
<span style="color: #268bd2;">father</span><span style="color: #f5deb3;">(</span><span style="color: #268bd2;">X</span><span style="color: #f5deb3;">)</span>  =  <span style="color: #268bd2;">X</span>.
</pre>
</div>

<p>
Yes, it does.
</p>

<p>
To what?
</p>

<p>
…it depends. The expression is defined to be unifiable, but its
display is implementation-dependent. <sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>
</p>


<p>
What is displayed will vary based on the prolog implementation, but
any of them will allow the query to unify.
</p>

<p>
SWI-Prolog will answer
</p>

<div class="org-src-container">

<pre class="src src-prolog"><span style="color: #268bd2;">X</span> = father<span style="color: #f5deb3;">(</span><span style="color: #268bd2;">X</span><span style="color: #f5deb3;">)</span>.
</pre>
</div>

<p>
gprolog will refuse to output the unification, but will still
return `yes`, indicating that the expression unified.
</p>

<p>
Other implementations may try to display it as something like:
</p>

<div class="org-src-container">

<pre class="src src-prolog"><span style="color: #268bd2;">X</span>  =  father<span style="color: #f5deb3;">(</span>father<span style="color: #b58900;">(</span>father<span style="color: #268bd2;">(</span>father<span style="color: #dc322f;">(</span>...<span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span><span style="color: #839496; background-color: #002b36;">))))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-6" class="outline-4">
<h4 id="sec-1-1-6">Queries</h4>
<div class="outline-text-4" id="text-1-1-6">
<div class="org-src-container">

<pre class="src src-prolog">?- cat<span style="color: #f5deb3;">(</span> <span style="color: #268bd2;">X</span> <span style="color: #f5deb3;">)</span>.
<span style="color: #268bd2;">X</span> = sylvester
<span style="color: #268bd2;">X</span> = tom
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-7" class="outline-4">
<h4 id="sec-1-1-7">Lists</h4>
<div class="outline-text-4" id="text-1-1-7">
<div class="org-src-container">

<pre class="src src-prolog"><span style="color: #f5deb3; font-weight: bold;">[</span>1, 2, a<span style="color: #f5deb3; font-weight: bold;">]</span>.
<span style="color: #f5deb3; font-weight: bold;">[</span>1, a<span style="color: #b58900;">(</span> 1, 2 <span style="color: #b58900;">)</span>, 3<span style="color: #f5deb3; font-weight: bold;">]</span>.
<span style="color: #f5deb3; font-weight: bold;">[</span><span style="color: #268bd2;">A</span>, b, c<span style="color: #f5deb3; font-weight: bold;">]</span>.

<span style="color: #859900; font-weight: bold;">|</span> ?- <span style="color: #f5deb3; font-weight: bold;">[</span>1,2,3<span style="color: #f5deb3; font-weight: bold;">]</span> = <span style="color: #f5deb3; font-weight: bold;">[</span><span style="color: #268bd2;">A</span><span style="color: #859900; font-weight: bold;">|</span><span style="color: #268bd2;">Tail</span><span style="color: #f5deb3; font-weight: bold;">]</span>.
<span style="color: #268bd2;">A</span> = 1
<span style="color: #268bd2;">Tail</span> = <span style="color: #f5deb3; font-weight: bold;">[</span>2,3<span style="color: #f5deb3; font-weight: bold;">]</span>

<span style="color: #859900; font-weight: bold;">|</span> ?- <span style="color: #f5deb3; font-weight: bold;">[</span>1,2,3<span style="color: #f5deb3; font-weight: bold;">]</span> = <span style="color: #f5deb3; font-weight: bold;">[</span><span style="color: #268bd2;">A</span><span style="color: #859900; font-weight: bold;">|</span><span style="color: #b58900; font-weight: bold;">[</span><span style="color: #268bd2;">B</span><span style="color: #859900; font-weight: bold;">|</span><span style="color: #268bd2;">Tail</span><span style="color: #b58900; font-weight: bold;">]</span><span style="color: #f5deb3; font-weight: bold;">]</span>.

<span style="color: #268bd2;">A</span> = 1
<span style="color: #268bd2;">B</span> = 2
<span style="color: #268bd2;">Tail</span> = <span style="color: #f5deb3; font-weight: bold;">[</span>3<span style="color: #f5deb3; font-weight: bold;">]</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-8" class="outline-4">
<h4 id="sec-1-1-8">Append</h4>
<div class="outline-text-4" id="text-1-1-8">
<p>
Let's consider a definition of Prolog's append/3: <sup><a id="fnr.1.100" name="fnr.1.100" class="footref" href="#fn.1">1</a></sup>
</p>
<div class="org-src-container">

<pre class="src src-prolog"><span style="color: #268bd2;">append</span><span style="color: #f5deb3;">(</span> <span style="color: #b58900; font-weight: bold;">[]</span>, <span style="color: #268bd2;">L</span>, <span style="color: #268bd2;">L</span> <span style="color: #f5deb3;">)</span>.
<span style="color: #268bd2;">append</span><span style="color: #f5deb3;">(</span> <span style="color: #b58900; font-weight: bold;">[</span><span style="color: #268bd2;">H</span><span style="color: #859900; font-weight: bold;">|</span><span style="color: #268bd2;">T</span><span style="color: #b58900; font-weight: bold;">]</span>, <span style="color: #268bd2;">L2</span>, <span style="color: #b58900; font-weight: bold;">[</span><span style="color: #268bd2;">H</span><span style="color: #859900; font-weight: bold;">|</span><span style="color: #268bd2;">L3</span><span style="color: #b58900; font-weight: bold;">]</span> <span style="color: #f5deb3;">)</span> :- append<span style="color: #f5deb3;">(</span> <span style="color: #268bd2;">T</span>, <span style="color: #268bd2;">L2</span>, <span style="color: #268bd2;">L3</span> <span style="color: #f5deb3;">)</span>.
</pre>
</div>

<p>
Demonstrates the Head|Tail list deconstruction.
</p>

<p>
Read as:
  appending the empty list to any list L results in the list L.
</p>

<p>
when we append a non-empty list [H|T] with a list L2, we get
the list whose head is H and
whose tail is the result of appending T with L2 .
</p>
</div>
</div>
