alchemy.org
*** Using Append

    Because of the nature of logical programming, append/3
    can be used to /break-up/ lists:
    #+BEGIN_SRC prolog
      append( X, Y, [a,b,c,d] ).

      X  =  []
      Y  =  [a,b,c,d]

      X  =  [a]
      Y  =  [b,c,d]

      X  =  [a,b]
      Y  =  [c,d]

      X  =  [a,b,c]
      Y  =  [d]

      X  =  [a,b,c,d]
      Y  =  []
    #+END_SRC

    Goals in a logic language can be run /backward/.

*** Permutation

    #+BEGIN_SRC prolog
      permutation( [1,2,3], L ).

      L = [1,2,3]
      L = [1,3,2]
      L = [2,1,3]
      L = [2,3,1]
      L = [3,1,2]
      L = [3,2,1]

      permutation( [1, A, 3], [3, 2, 1] ).

      A = 2
    #+END_SRC

    /Permutation/, in Prolog, can be defined in terms of /append/.


