alchemy.html


<div id="outline-container-sec-1-1-9" class="outline-4">
<h4 id="sec-1-1-9">Using Append</h4>
<div class="outline-text-4" id="text-1-1-9">
<p>
Because of the nature of logical programming, append/3
can be used to <i>break-up</i> lists:
</p>
<div class="org-src-container">

<pre class="src src-prolog"><span style="color: #268bd2;">append</span><span style="color: #f5deb3;">(</span> <span style="color: #268bd2;">X</span>, <span style="color: #268bd2;">Y</span>, <span style="color: #b58900; font-weight: bold;">[</span>a,b,c,d<span style="color: #b58900; font-weight: bold;">]</span> <span style="color: #f5deb3;">)</span>.

<span style="color: #268bd2;">X</span>  =  <span style="color: #f5deb3; font-weight: bold;">[]</span>
<span style="color: #268bd2;">Y</span>  =  <span style="color: #f5deb3; font-weight: bold;">[</span>a,b,c,d<span style="color: #f5deb3; font-weight: bold;">]</span>

<span style="color: #268bd2;">X</span>  =  <span style="color: #f5deb3; font-weight: bold;">[</span>a<span style="color: #f5deb3; font-weight: bold;">]</span>
<span style="color: #268bd2;">Y</span>  =  <span style="color: #f5deb3; font-weight: bold;">[</span>b,c,d<span style="color: #f5deb3; font-weight: bold;">]</span>

<span style="color: #268bd2;">X</span>  =  <span style="color: #f5deb3; font-weight: bold;">[</span>a,b<span style="color: #f5deb3; font-weight: bold;">]</span>
<span style="color: #268bd2;">Y</span>  =  <span style="color: #f5deb3; font-weight: bold;">[</span>c,d<span style="color: #f5deb3; font-weight: bold;">]</span>

<span style="color: #268bd2;">X</span>  =  <span style="color: #f5deb3; font-weight: bold;">[</span>a,b,c<span style="color: #f5deb3; font-weight: bold;">]</span>
<span style="color: #268bd2;">Y</span>  =  <span style="color: #f5deb3; font-weight: bold;">[</span>d<span style="color: #f5deb3; font-weight: bold;">]</span>

<span style="color: #268bd2;">X</span>  =  <span style="color: #f5deb3; font-weight: bold;">[</span>a,b,c,d<span style="color: #f5deb3; font-weight: bold;">]</span>
<span style="color: #268bd2;">Y</span>  =  <span style="color: #f5deb3; font-weight: bold;">[]</span>
</pre>
</div>

<p>
Goals in a logic language can be run <i>backward</i>.
</p>
</div>
</div>

<div id="outline-container-sec-1-1-10" class="outline-4">
<h4 id="sec-1-1-10">Permutation</h4>
<div class="outline-text-4" id="text-1-1-10">
<div class="org-src-container">

<pre class="src src-prolog"><span style="color: #268bd2;">permutation</span><span style="color: #f5deb3;">(</span> <span style="color: #b58900; font-weight: bold;">[</span>1,2,3<span style="color: #b58900; font-weight: bold;">]</span>, <span style="color: #268bd2;">L</span> <span style="color: #f5deb3;">)</span>.

<span style="color: #268bd2;">L</span> = <span style="color: #f5deb3; font-weight: bold;">[</span>1,2,3<span style="color: #f5deb3; font-weight: bold;">]</span>
<span style="color: #268bd2;">L</span> = <span style="color: #f5deb3; font-weight: bold;">[</span>1,3,2<span style="color: #f5deb3; font-weight: bold;">]</span>
<span style="color: #268bd2;">L</span> = <span style="color: #f5deb3; font-weight: bold;">[</span>2,1,3<span style="color: #f5deb3; font-weight: bold;">]</span>
<span style="color: #268bd2;">L</span> = <span style="color: #f5deb3; font-weight: bold;">[</span>2,3,1<span style="color: #f5deb3; font-weight: bold;">]</span>
<span style="color: #268bd2;">L</span> = <span style="color: #f5deb3; font-weight: bold;">[</span>3,1,2<span style="color: #f5deb3; font-weight: bold;">]</span>
<span style="color: #268bd2;">L</span> = <span style="color: #f5deb3; font-weight: bold;">[</span>3,2,1<span style="color: #f5deb3; font-weight: bold;">]</span>

<span style="color: #268bd2;">permutation</span><span style="color: #f5deb3;">(</span> <span style="color: #b58900; font-weight: bold;">[</span>1, <span style="color: #268bd2;">A</span>, 3<span style="color: #b58900; font-weight: bold;">]</span>, <span style="color: #b58900; font-weight: bold;">[</span>3, 2, 1<span style="color: #b58900; font-weight: bold;">]</span> <span style="color: #f5deb3;">)</span>.

<span style="color: #268bd2;">A</span> = 2
</pre>
</div>

<p>
<i>Permutation</i>, in Prolog, can be defined in terms of <i>append</i>.
</p>
</div>
</div>
