alchemy.org
*** Alchemy Facts: mapping ingredients to effects:

   #+BEGIN_SRC prolog :tangle src/alchemy.pl
     % -*- mode: prolog -*-
     effect( abecean_longfin, fortify_restoration ).
     effect( abecean_longfin, fortify_sneak ).
     effect( abecean_longfin, weakness_to_frost ).
     effect( abecean_longfin, weakness_to_poison ).

     effect( ancestor_moth_wing, damage_magicka_regen ).
     effect( ancestor_moth_wing, damage_stamina ).
     effect( ancestor_moth_wing, fortify_conjuration ).
     effect( ancestor_moth_wing, fortify_enchanting ).

     effect( bear_claws, damage_magicka_regen ).
     effect( bear_claws, fortify_health ).
     effect( bear_claws, fortify_one_handed ).
     effect( bear_claws, restore_stamina ).

     effect( bee, ravage_stamina ).
     effect( bee, regenerate_stamina ).
     effect( bee, restore_stamina ).
     effect( bee, weakness_to_shock ).
   #+END_SRC

   and so on for all available ingredients.

   #+BEGIN_SRC prolog :tangle src/alchemy.pl :exports none
     effect( beehive_husk, fortify_destruction ).
     effect( beehive_husk, fortify_light_armor ).
     effect( beehive_husk, fortify_sneak ).
     effect( beehive_husk, resist_poison ).

     effect( bleeding_crown, fortify_block ).
     effect( bleeding_crown, resist_magic ).
     effect( bleeding_crown, weakness_to_fire ).
     effect( bleeding_crown, weakness_to_poison ).

     effect( blisterwort, damage_stamina ).
     effect( blisterwort, fortify_smithing ).
     effect( blisterwort, frenzy ).
     effect( blisterwort, restore_health ).

     effect( blue_butterfly_wing, damage_magicka_regen ).
     effect( blue_butterfly_wing, damage_stamina ).
     effect( blue_butterfly_wing, fortify_conjuration ).
     effect( blue_butterfly_wing, fortify_enchanting ).

     effect( blue_dartwing, fear ).
     effect( blue_dartwing, fortify_pickpocket ).
     effect( blue_dartwing, resist_shock ).
     effect( blue_dartwing, restore_health ).

     effect( blue_mountain_flower, damage_magicka_regen ).
     effect( blue_mountain_flower, fortify_conjuration ).
     effect( blue_mountain_flower, fortify_health ).
     effect( blue_mountain_flower, restore_health ).

     effect( bone_meal, damage_stamina ).
     effect( bone_meal, fortify_conjuration ).
     effect( bone_meal, ravage_stamina ).
     effect( bone_meal, resist_fire ).

     effect( briar_heart, fortify_block ).
     effect( briar_heart, fortify_magicka ).
     effect( briar_heart, paralysis ).
     effect( briar_heart, restore_magicka ).

     effect( butterfly_wing, damage_magicka ).
     effect( butterfly_wing, fortify_barter ).
     effect( butterfly_wing, lingering_damage_stamina ).
     effect( butterfly_wing, restore_health ).

     effect( canis_root, damage_stamina ).
     effect( canis_root, fortify_marksman ).
     effect( canis_root, fortify_one_handed ).
     effect( canis_root, paralysis ).

     effect( charred_skeever_hide, cure_disease ).
     effect( charred_skeever_hide, resist_poison ).
     effect( charred_skeever_hide, restore_health ).
     effect( charred_skeever_hide, restore_stamina ).

     effect( chaurus_eggs, damage_magicka ).
     effect( chaurus_eggs, fortify_stamina ).
     effect( chaurus_eggs, invisibility ).
     effect( chaurus_eggs, weakness_to_poison ).

     effect( chaurus_hunter_antennae, damage_magicka_regen ).
     effect( chaurus_hunter_antennae, damage_stamina ).
     effect( chaurus_hunter_antennae, fortify_conjuration ).
     effect( chaurus_hunter_antennae, fortify_enchanting ).

     effect( chicken_egg, damage_magicka_regen ).
     effect( chicken_egg, lingering_damage_stamina ).
     effect( chicken_egg, resist_magic ).
     effect( chicken_egg, waterbreathing ).

     effect( creep_cluster, damage_stamina_regen ).
     effect( creep_cluster, fortify_carry_weight ).
     effect( creep_cluster, restore_magicka ).
     effect( creep_cluster, weakness_to_magic ).

     effect( crimson_nirnroot, damage_health ).
     effect( crimson_nirnroot, damage_stamina ).
     effect( crimson_nirnroot, invisibility ).
     effect( crimson_nirnroot, resist_magic ).

     effect( cyrodilic_spadetail, damage_stamina ).
     effect( cyrodilic_spadetail, fear ).
     effect( cyrodilic_spadetail, fortify_restoration ).
     effect( cyrodilic_spadetail, ravage_health ).

     effect( daedra_heart, damage_magicka ).
     effect( daedra_heart, damage_stamina_regen ).
     effect( daedra_heart, fear ).
     effect( daedra_heart, restore_health ).

     effect( deathbell, damage_health ).
     effect( deathbell, ravage_stamina ).
     effect( deathbell, slow ).
     effect( deathbell, weakness_to_poison ).

     effect( dragons_tongue, fortify_barter ).
     effect( dragons_tongue, fortify_illusion ).
     effect( dragons_tongue, fortify_two_handed ).
     effect( dragons_tongue, resist_fire ).

     effect( dwarven_oil, fortify_illusion ).
     effect( dwarven_oil, regenerate_magicka ).
     effect( dwarven_oil, restore_magicka ).
     effect( dwarven_oil, weakness_to_magic ).

     effect( ectoplasm, damage_health ).
     effect( ectoplasm, fortify_destruction ).
     effect( ectoplasm, fortify_magicka ).
     effect( ectoplasm, restore_magicka ).

     effect( elves_ear, fortify_marksman ).
     effect( elves_ear, resist_fire ).
     effect( elves_ear, restore_magicka ).
     effect( elves_ear, weakness_to_frost ).

     effect( eye_of_sabre_cat, damage_magicka ).
     effect( eye_of_sabre_cat, ravage_health ).
     effect( eye_of_sabre_cat, restore_health ).
     effect( eye_of_sabre_cat, restore_stamina ).

     effect( falmer_ear, damage_health ).
     effect( falmer_ear, fortify_lockpicking ).
     effect( falmer_ear, frenzy ).
     effect( falmer_ear, resist_poison ).

     effect( fire_salts, regenerate_magicka ).
     effect( fire_salts, resist_fire ).
     effect( fire_salts, restore_magicka ).
     effect( fire_salts, weakness_to_frost ).

     effect( fly_amanita, fortify_two_handed ).
     effect( fly_amanita, frenzy ).
     effect( fly_amanita, regenerate_stamina ).
     effect( fly_amanita, resist_fire ).

     effect( frost_mirriam, damage_stamina_regen ).
     effect( frost_mirriam, fortify_sneak ).
     effect( frost_mirriam, ravage_magicka ).
     effect( frost_mirriam, resist_frost ).

     effect( frost_salts, fortify_conjuration ).
     effect( frost_salts, resist_frost ).
     effect( frost_salts, restore_magicka ).
     effect( frost_salts, weakness_to_fire ).

     effect( garlic, fortify_stamina ).
     effect( garlic, regenerate_health ).
     effect( garlic, regenerate_magicka ).
     effect( garlic, resist_poison ).

     effect( giant_lichen, ravage_health ).
     effect( giant_lichen, restore_magicka ).
     effect( giant_lichen, weakness_to_poison ).
     effect( giant_lichen, weakness_to_shock ).

     effect( giants_toe, damage_stamina ).
     effect( giants_toe, damage_stamina_regen ).
     effect( giants_toe, fortify_carry_weight ).
     effect( giants_toe, fortify_health ).

     effect( gleamblossom, fear ).
     effect( gleamblossom, paralysis ).
     effect( gleamblossom, regenerate_health ).
     effect( gleamblossom, resist_magic ).

     effect( glow_dust, damage_magicka ).
     effect( glow_dust, damage_magicka_regen ).
     effect( glow_dust, fortify_destruction ).
     effect( glow_dust, resist_shock ).

     effect( glowing_mushroom, fortify_destruction ).
     effect( glowing_mushroom, fortify_health ).
     effect( glowing_mushroom, fortify_smithing ).
     effect( glowing_mushroom, resist_shock ).

     effect( grass_pod, fortify_alteration ).
     effect( grass_pod, ravage_magicka ).
     effect( grass_pod, resist_poison ).
     effect( grass_pod, restore_magicka ).

     effect( hagraven_claw, fortify_barter ).
     effect( hagraven_claw, fortify_enchanting ).
     effect( hagraven_claw, lingering_damage_magicka ).
     effect( hagraven_claw, resist_magic ).

     effect( hagraven_feathers, damage_magicka ).
     effect( hagraven_feathers, fortify_conjuration ).
     effect( hagraven_feathers, frenzy ).
     effect( hagraven_feathers, weakness_to_shock ).

     effect( hanging_moss, damage_magicka ).
     effect( hanging_moss, damage_magicka_regen ).
     effect( hanging_moss, fortify_health ).
     effect( hanging_moss, fortify_one_handed ).

     effect( hawks_egg, resist_magic ).
     effect( hawks_egg, damage_magicka_regen ).
     effect( hawks_egg, waterbreathing ).
     effect( hawks_egg, lingering_damage_stamina ).

     effect( hawk_beak, fortify_carry_weight ).
     effect( hawk_beak, resist_frost ).
     effect( hawk_beak, resist_shock ).
     effect( hawk_beak, restore_stamina ).

     effect( hawk_feathers, cure_disease ).
     effect( hawk_feathers, fortify_light_armor ).
     effect( hawk_feathers, fortify_one_handed ).
     effect( hawk_feathers, fortify_sneak ).

     effect( histcarp, damage_stamina_regen ).
     effect( histcarp, fortify_magicka ).
     effect( histcarp, restore_stamina ).
     effect( histcarp, waterbreathing ).

     effect( honeycomb, fortify_block ).
     effect( honeycomb, fortify_light_armor ).
     effect( honeycomb, ravage_stamina ).
     effect( honeycomb, restore_stamina ).

     effect( human_flesh, damage_health ).
     effect( human_flesh, fortify_sneak ).
     effect( human_flesh, paralysis ).
     effect( human_flesh, restore_magicka ).

     effect( human_heart, damage_health ).
     effect( human_heart, damage_magicka ).
     effect( human_heart, damage_magicka_regen ).
     effect( human_heart, frenzy ).

     effect( ice_wraith_teeth, fortify_heavy_armor ).
     effect( ice_wraith_teeth, invisibility ).
     effect( ice_wraith_teeth, weakness_to_fire ).
     effect( ice_wraith_teeth, weakness_to_frost ).

     effect( imp_stool, damage_health ).
     effect( imp_stool, lingering_damage_health ).
     effect( imp_stool, paralysis ).
     effect( imp_stool, restore_health ).

     effect( jasbay_grapes, fortify_magicka ).
     effect( jasbay_grapes, ravage_health ).
     effect( jasbay_grapes, regenerate_magicka ).
     effect( jasbay_grapes, weakness_to_magic ).

     effect( juniper_berries, damage_stamina_regen ).
     effect( juniper_berries, fortify_marksman ).
     effect( juniper_berries, regenerate_health ).
     effect( juniper_berries, weakness_to_fire ).

     effect( large_antlers, damage_stamina_regen ).
     effect( large_antlers, fortify_stamina ).
     effect( large_antlers, restore_stamina ).
     effect( large_antlers, slow ).

     effect( lavender, fortify_conjuration ).
     effect( lavender, fortify_stamina ).
     effect( lavender, ravage_magicka ).
     effect( lavender, resist_magic ).

     effect( luna_moth_wing, damage_magicka ).
     effect( luna_moth_wing, fortify_light_armor ).
     effect( luna_moth_wing, invisibility ).
     effect( luna_moth_wing, regenerate_health ).

     effect( moon_sugar, regenerate_magicka ).
     effect( moon_sugar, resist_frost ).
     effect( moon_sugar, restore_magicka ).
     effect( moon_sugar, weakness_to_fire ).

     effect( mora_tapinella, fortify_illusion ).
     effect( mora_tapinella, lingering_damage_health ).
     effect( mora_tapinella, regenerate_stamina ).
     effect( mora_tapinella, restore_magicka ).

     effect( mudcrab_chitin, cure_disease ).
     effect( mudcrab_chitin, resist_fire ).
     effect( mudcrab_chitin, resist_poison ).
     effect( mudcrab_chitin, restore_stamina ).

     effect( namiras_rot, damage_magicka ).
     effect( namiras_rot, fear ).
     effect( namiras_rot, fortify_lockpicking ).
     effect( namiras_rot, regenerate_health ).

     effect( nightshade, damage_health ).
     effect( nightshade, damage_magicka_regen ).
     effect( nightshade, fortify_destruction ).
     effect( nightshade, lingering_damage_stamina ).

     effect( nirnroot, damage_health ).
     effect( nirnroot, damage_stamina ).
     effect( nirnroot, invisibility ).
     effect( nirnroot, resist_magic ).

     effect( nordic_barnacle, damage_magicka ).
     effect( nordic_barnacle, fortify_pickpocket ).
     effect( nordic_barnacle, regenerate_health ).
     effect( nordic_barnacle, waterbreathing ).

     effect( orange_dartwing, fortify_pickpocket ).
     effect( orange_dartwing, lingering_damage_health ).
     effect( orange_dartwing, ravage_magicka ).
     effect( orange_dartwing, restore_stamina ).

     effect( pearl, fortify_block ).
     effect( pearl, resist_shock ).
     effect( pearl, restore_magicka ).
     effect( pearl, restore_stamina ).

     effect( pine_thrush_egg, fortify_lockpicking ).
     effect( pine_thrush_egg, resist_shock ).
     effect( pine_thrush_egg, restore_stamina ).
     effect( pine_thrush_egg, weakness_to_poison ).

     effect( poison_bloom, damage_health ).
     effect( poison_bloom, fear ).
     effect( poison_bloom, fortify_carry_weight ).
     effect( poison_bloom, slow ).

     effect( powdered_mammoth_tusk, fear ).
     effect( powdered_mammoth_tusk, fortify_sneak ).
     effect( powdered_mammoth_tusk, restore_stamina ).
     effect( powdered_mammoth_tusk, weakness_to_fire ).

     effect( purple_mountain_flower, fortify_sneak ).
     effect( purple_mountain_flower, lingering_damage_magicka ).
     effect( purple_mountain_flower, resist_frost ).
     effect( purple_mountain_flower, restore_stamina ).

     effect( red_mountain_flower, damage_health ).
     effect( red_mountain_flower, fortify_magicka ).
     effect( red_mountain_flower, ravage_magicka ).
     effect( red_mountain_flower, restore_magicka ).

     effect( river_betty, damage_health ).
     effect( river_betty, fortify_alteration ).
     effect( river_betty, fortify_carry_weight ).
     effect( river_betty, slow ).

     effect( rock_warbler_egg, damage_stamina ).
     effect( rock_warbler_egg, fortify_one_handed ).
     effect( rock_warbler_egg, restore_health ).
     effect( rock_warbler_egg, weakness_to_magic ).

     effect( sabre_cat_tooth, fortify_heavy_armor ).
     effect( sabre_cat_tooth, fortify_smithing ).
     effect( sabre_cat_tooth, restore_stamina ).
     effect( sabre_cat_tooth, weakness_to_poison ).

     effect( salmon_roe, restore_stamina ).
     effect( salmon_roe, waterbreathing ).
     effect( salmon_roe, fortify_magicka ).
     effect( salmon_roe, regenerate_magicka ).

     effect( salt_pile, fortify_restoration ).
     effect( salt_pile, regenerate_magicka ).
     effect( salt_pile, slow ).
     effect( salt_pile, weakness_to_magic ).

     effect( scaly_pholiota, fortify_carry_weight ).
     effect( scaly_pholiota, fortify_illusion ).
     effect( scaly_pholiota, regenerate_stamina ).
     effect( scaly_pholiota, weakness_to_magic ).

     effect( silverside_perch, damage_stamina_regen ).
     effect( silverside_perch, ravage_health ).
     effect( silverside_perch, resist_frost ).
     effect( silverside_perch, restore_stamina ).

     effect( skeever_tail, damage_health ).
     effect( skeever_tail, damage_stamina_regen ).
     effect( skeever_tail, fortify_light_armor ).
     effect( skeever_tail, ravage_health ).

     effect( slaughterfish_egg, fortify_pickpocket ).
     effect( slaughterfish_egg, fortify_stamina ).
     effect( slaughterfish_egg, lingering_damage_magicka ).
     effect( slaughterfish_egg, resist_poison ).

     effect( slaughterfish_scales, fortify_block ).
     effect( slaughterfish_scales, fortify_heavy_armor ).
     effect( slaughterfish_scales, lingering_damage_health ).
     effect( slaughterfish_scales, resist_frost ).

     effect( small_antlers, damage_health ).
     effect( small_antlers, fortify_restoration ).
     effect( small_antlers, lingering_damage_stamina ).
     effect( small_antlers, weakness_to_poison ).

     effect( small_pearl, fortify_one_handed ).
     effect( small_pearl, fortify_restoration ).
     effect( small_pearl, resist_frost ).
     effect( small_pearl, restore_stamina ).

     effect( snowberries, fortify_enchanting ).
     effect( snowberries, resist_fire ).
     effect( snowberries, resist_frost ).
     effect( snowberries, resist_shock ).

     effect( spider_egg, damage_magicka_regen ).
     effect( spider_egg, damage_stamina ).
     effect( spider_egg, fortify_lockpicking ).
     effect( spider_egg, fortify_marksman ).

     effect( spriggan_sap, damage_magicka_regen ).
     effect( spriggan_sap, fortify_alteration ).
     effect( spriggan_sap, fortify_enchanting ).
     effect( spriggan_sap, fortify_smithing ).

     effect( swamp_fungal_pod, lingering_damage_magicka ).
     effect( swamp_fungal_pod, paralysis ).
     effect( swamp_fungal_pod, resist_shock ).
     effect( swamp_fungal_pod, restore_health ).

     effect( taproot, fortify_illusion ).
     effect( taproot, regenerate_magicka ).
     effect( taproot, restore_magicka ).
     effect( taproot, weakness_to_magic ).

     effect( thistle_branch, fortify_heavy_armor ).
     effect( thistle_branch, ravage_stamina ).
     effect( thistle_branch, resist_frost ).
     effect( thistle_branch, resist_poison ).

     effect( torchbug_thorax, fortify_stamina ).
     effect( torchbug_thorax, lingering_damage_magicka ).
     effect( torchbug_thorax, restore_stamina ).
     effect( torchbug_thorax, weakness_to_magic ).

     effect( troll_fat, damage_health ).
     effect( troll_fat, fortify_two_handed ).
     effect( troll_fat, frenzy ).
     effect( troll_fat, resist_poison ).

     effect( tundra_cotton, fortify_barter ).
     effect( tundra_cotton, fortify_block ).
     effect( tundra_cotton, fortify_magicka ).
     effect( tundra_cotton, resist_magic ).

     effect( vampire_dust, cure_disease ).
     effect( vampire_dust, invisibility ).
     effect( vampire_dust, regenerate_health ).
     effect( vampire_dust, restore_magicka ).

     effect( void_salts, damage_health ).
     effect( void_salts, fortify_magicka ).
     effect( void_salts, resist_magic ).
     effect( void_salts, weakness_to_shock ).

     effect( wheat, damage_stamina_regen ).
     effect( wheat, fortify_health ).
     effect( wheat, lingering_damage_magicka ).
     effect( wheat, restore_health ).

     effect( white_cap, fortify_heavy_armor ).
     effect( white_cap, ravage_magicka ).
     effect( white_cap, restore_magicka ).
     effect( white_cap, weakness_to_frost ).

     effect( wisp_wrappings, fortify_carry_weight ).
     effect( wisp_wrappings, fortify_destruction ).
     effect( wisp_wrappings, resist_magic ).
     effect( wisp_wrappings, restore_stamina ).

     effect( yellow_mountain_flower, damage_stamina_regen ).
     effect( yellow_mountain_flower, fortify_health ).
     effect( yellow_mountain_flower, fortify_restoration ).
     effect( yellow_mountain_flower, resist_poison ).
   #+END_SRC

