alchemy.html


<div id="outline-container-sec-1-1-11" class="outline-4">
<h4 id="sec-1-1-11">Alchemy Facts: mapping ingredients to effects:</h4>
<div class="outline-text-4" id="text-1-1-11">
<div class="org-src-container">

<pre class="src src-prolog"><span style="color: #586e75;">% </span><span style="color: #586e75;">-*- mode: prolog -*-</span>
<span style="color: #268bd2;">effect</span><span style="color: #f5deb3;">(</span> abecean_longfin, fortify_restoration <span style="color: #f5deb3;">)</span>.
<span style="color: #268bd2;">effect</span><span style="color: #f5deb3;">(</span> abecean_longfin, fortify_sneak <span style="color: #f5deb3;">)</span>.
<span style="color: #268bd2;">effect</span><span style="color: #f5deb3;">(</span> abecean_longfin, weakness_to_frost <span style="color: #f5deb3;">)</span>.
<span style="color: #268bd2;">effect</span><span style="color: #f5deb3;">(</span> abecean_longfin, weakness_to_poison <span style="color: #f5deb3;">)</span>.

<span style="color: #268bd2;">effect</span><span style="color: #f5deb3;">(</span> ancestor_moth_wing, damage_magicka_regen <span style="color: #f5deb3;">)</span>.
<span style="color: #268bd2;">effect</span><span style="color: #f5deb3;">(</span> ancestor_moth_wing, damage_stamina <span style="color: #f5deb3;">)</span>.
<span style="color: #268bd2;">effect</span><span style="color: #f5deb3;">(</span> ancestor_moth_wing, fortify_conjuration <span style="color: #f5deb3;">)</span>.
<span style="color: #268bd2;">effect</span><span style="color: #f5deb3;">(</span> ancestor_moth_wing, fortify_enchanting <span style="color: #f5deb3;">)</span>.

<span style="color: #268bd2;">effect</span><span style="color: #f5deb3;">(</span> bear_claws, damage_magicka_regen <span style="color: #f5deb3;">)</span>.
<span style="color: #268bd2;">effect</span><span style="color: #f5deb3;">(</span> bear_claws, fortify_health <span style="color: #f5deb3;">)</span>.
<span style="color: #268bd2;">effect</span><span style="color: #f5deb3;">(</span> bear_claws, fortify_one_handed <span style="color: #f5deb3;">)</span>.
<span style="color: #268bd2;">effect</span><span style="color: #f5deb3;">(</span> bear_claws, restore_stamina <span style="color: #f5deb3;">)</span>.

<span style="color: #268bd2;">effect</span><span style="color: #f5deb3;">(</span> bee, ravage_stamina <span style="color: #f5deb3;">)</span>.
<span style="color: #268bd2;">effect</span><span style="color: #f5deb3;">(</span> bee, regenerate_stamina <span style="color: #f5deb3;">)</span>.
<span style="color: #268bd2;">effect</span><span style="color: #f5deb3;">(</span> bee, restore_stamina <span style="color: #f5deb3;">)</span>.
<span style="color: #268bd2;">effect</span><span style="color: #f5deb3;">(</span> bee, weakness_to_shock <span style="color: #f5deb3;">)</span>.
</pre>
</div>

<p>
and so on for all available ingredients.
</p>
</div>
</div>
