alchemy.org
*** Rules for Mixing

   A potion can be created if two ingredients are combined that share at least one effect:

   #+BEGIN_SRC prolog :tangle src/alchemy.pl
     potion( IngredientA, IngredientB ) :-
       potion( IngredientA, IngredientB, _ ).

     potion( IngredientA, IngredientB, Effect ) :-
         effect( IngredientA, Effect ),
         effect( IngredientB, Effect ),
         IngredientA \= IngredientB.
   #+END_SRC

   Given a list of ingredients, what potions can be mixed?

   #+BEGIN_SRC prolog :tangle src/alchemy.pl
     mixes( [], _, _, _ ) :- fail.
     mixes( L, Ia, Ib, E ) :-
         permutation( L, [Ia|[Ib|_]] ),
         potion( Ia, Ib, E ).
   #+END_SRC

*** Running

    Start the Prolog interpreter.  I'm using GNU Prolog here, but
    others should work as well.

    Next, load the code:

    #+BEGIN_SRC prolog
      | ?- consult('alchemy.pl').
      compiling alchemy.pl for byte code...
      alchemy.pl compiled, 504 lines read - 51392 bytes written, 36 ms

      (9 ms) yes
      | ?-
    #+END_SRC

    =| ?-= is the prolog prompt in this implementation.

    Now we can try a query:

    #+BEGIN_SRC prolog
    | ?- potion( wisp_wrappings, white_cap ).

    no
    | ?-
    #+END_SRC

    So, that combination returns no matches, i.e., those ingredients
    do not mix to form a potion.

    Let's try different ingredients:

    #+BEGIN_SRC prolog
      | ?- potion( wheat, hanging_moss ).

      true ?
    #+END_SRC

    This is Prolog telling us that those ingredients do mix.  The =?=
    prompt is waiting for us to ask for more results, which we can do
    by entering =;=:

    #+BEGIN_SRC prolog
    true ? ;

    no
    | ?-
    #+END_SRC

    Turns out that is the only result.

    Let's imagine we're in dire need of a healing potion, what
    ingredients can we use?

    #+BEGIN_SRC prolog
      | ?- potion( A, B, restore_health ).

      A = blisterwort
      B = blue_dartwing ? ;

      A = blisterwort
      B = blue_mountain_flower ? ;
    #+END_SRC

    …and so on.

    Maybe we have some wheat on hand, what can we combine it with?

    #+BEGIN_SRC prolog
      | ?- potion( wheat, Ingredient, Effect ).

      Effect = damage_stamina_regen
      Ingredient = creep_cluster ? ;

      Effect = damage_stamina_regen
      Ingredient = daedra_heart ? ;

      Effect = damage_stamina_regen
      Ingredient = frost_mirriam ? ;

      Effect = damage_stamina_regen
      Ingredient = giants_toe ? ;

      Effect = damage_stamina_regen
      Ingredient = histcarp ?

      yes
      | ?-
    #+END_SRC

    I've got a bunch of ingredients, what can I make and sell?

    #+BEGIN_SRC prolog
      | ?- mixes( [wheat, vampire_dust, daedra_heart, troll_fat], A, B, E ).

      A = wheat
      B = daedra_heart
      E = damage_stamina_regen ? ;

      A = wheat
      B = daedra_heart
      E = restore_health ?

      yes
    #+END_SRC

    Another way to get ingredients for a particular potion:

    #+BEGIN_SRC prolog
      | ?- mixes( L, _, _, restore_health ).

      L = [blisterwort,blue_dartwing] ? ;

      L = [blisterwort,blue_mountain_flower] ?

      yes
    #+END_SRC

** Haskell

   In haskell, we can use list-comprehensions to perform similar sorts of searches.

