alchemy.html

<div id="outline-container-sec-1-1-12" class="outline-4">
<h4 id="sec-1-1-12">Rules for Mixing</h4>
<div class="outline-text-4" id="text-1-1-12">
<p>
A potion can be created if two ingredients are combined that share at least one effect:
</p>

<div class="org-src-container">

<pre class="src src-prolog"><span style="color: #268bd2;">potion</span><span style="color: #f5deb3;">(</span> <span style="color: #268bd2;">IngredientA</span>, <span style="color: #268bd2;">IngredientB</span> <span style="color: #f5deb3;">)</span> :- potion<span style="color: #f5deb3;">(</span> <span style="color: #268bd2;">IngredientA</span>, <span style="color: #268bd2;">IngredientB</span>, <span style="color: #268bd2;">_</span> <span style="color: #f5deb3;">)</span>.

<span style="color: #268bd2;">potion</span><span style="color: #f5deb3;">(</span> <span style="color: #268bd2;">IngredientA</span>, <span style="color: #268bd2;">IngredientB</span>, <span style="color: #268bd2;">Effect</span> <span style="color: #f5deb3;">)</span> :-
    effect<span style="color: #f5deb3;">(</span> <span style="color: #268bd2;">IngredientA</span>, <span style="color: #268bd2;">Effect</span> <span style="color: #f5deb3;">)</span>,
    effect<span style="color: #f5deb3;">(</span> <span style="color: #268bd2;">IngredientB</span>, <span style="color: #268bd2;">Effect</span> <span style="color: #f5deb3;">)</span>,
    <span style="color: #268bd2;">IngredientA</span> \= <span style="color: #268bd2;">IngredientB</span>.
</pre>
</div>

<p>
Given a list of ingredients, what potions can be mixed?
</p>

<div class="org-src-container">

<pre class="src src-prolog"><span style="color: #268bd2;">mixes</span><span style="color: #f5deb3;">(</span> <span style="color: #b58900; font-weight: bold;">[]</span>, <span style="color: #268bd2;">_</span>, <span style="color: #268bd2;">_</span>, <span style="color: #268bd2;">_</span> <span style="color: #f5deb3;">)</span> :- fail.
<span style="color: #268bd2;">mixes</span><span style="color: #f5deb3;">(</span> <span style="color: #268bd2;">L</span>, <span style="color: #268bd2;">Ia</span>, <span style="color: #268bd2;">Ib</span>, <span style="color: #268bd2;">E</span> <span style="color: #f5deb3;">)</span> :-
    permutation<span style="color: #f5deb3;">(</span> <span style="color: #268bd2;">L</span>, <span style="color: #b58900; font-weight: bold;">[</span><span style="color: #268bd2;">Ia</span><span style="color: #859900; font-weight: bold;">|</span><span style="color: #268bd2; font-weight: bold;">[</span><span style="color: #268bd2;">Ib</span><span style="color: #859900; font-weight: bold;">|</span><span style="color: #268bd2;">_</span><span style="color: #268bd2; font-weight: bold;">]</span><span style="color: #b58900; font-weight: bold;">]</span> <span style="color: #f5deb3;">)</span>,
    potion<span style="color: #f5deb3;">(</span> <span style="color: #268bd2;">Ia</span>, <span style="color: #268bd2;">Ib</span>, <span style="color: #268bd2;">E</span> <span style="color: #f5deb3;">)</span>.
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-13" class="outline-4">
<h4 id="sec-1-1-13">Running</h4>
<div class="outline-text-4" id="text-1-1-13">
<p>
Start the Prolog interpreter.  I'm using GNU Prolog here, but
others should work as well.
</p>

<p>
Next, load the code:
</p>

<div class="org-src-container">

<pre class="src src-prolog"><span style="color: #859900; font-weight: bold;">|</span> ?- consult<span style="color: #f5deb3;">(</span><span style="color: #2aa198;">'alchemy.pl'</span><span style="color: #f5deb3;">)</span>.
compiling alchemy.<span style="color: #268bd2;">pl</span> for byte code...
alchemy.<span style="color: #268bd2;">pl</span> compiled, 504 lines read - 51392 bytes written, 36 ms

<span style="color: #f5deb3;">(</span>9 ms<span style="color: #f5deb3;">)</span> yes
<span style="color: #859900; font-weight: bold;">|</span> ?-
</pre>
</div>

<p>
<code>| ?-</code> is the prolog prompt in this implementation.
</p>

<p>
Now we can try a query:
</p>

<div class="org-src-container">

<pre class="src src-prolog"><span style="color: #859900; font-weight: bold;">|</span> ?- potion<span style="color: #f5deb3;">(</span> wisp_wrappings, white_cap <span style="color: #f5deb3;">)</span>.

no
<span style="color: #859900; font-weight: bold;">|</span> ?-
</pre>
</div>

<p>
So, that combination returns no matches, i.e., those ingredients
do not mix to form a potion.
</p>

<p>
Let's try different ingredients:
</p>

<div class="org-src-container">

<pre class="src src-prolog"><span style="color: #859900; font-weight: bold;">|</span> ?- potion<span style="color: #f5deb3;">(</span> wheat, hanging_moss <span style="color: #f5deb3;">)</span>.

true ?
</pre>
</div>

<p>
This is Prolog telling us that those ingredients do mix.  The <code>?</code>
prompt is waiting for us to ask for more results, which we can do
by entering <code>;</code>:
</p>

<div class="org-src-container">

<pre class="src src-prolog">true ? <span style="color: #859900; font-weight: bold;">;</span>

no
<span style="color: #859900; font-weight: bold;">|</span> ?-
</pre>
</div>

<p>
Turns out that is the only result.
</p>

<p>
Let's imagine we're in dire need of a healing potion, what
ingredients can we use?
</p>

<div class="org-src-container">

<pre class="src src-prolog"><span style="color: #859900; font-weight: bold;">|</span> ?- potion<span style="color: #f5deb3;">(</span> <span style="color: #268bd2;">A</span>, <span style="color: #268bd2;">B</span>, restore_health <span style="color: #f5deb3;">)</span>.

<span style="color: #268bd2;">A</span> = blisterwort
<span style="color: #268bd2;">B</span> = blue_dartwing ? <span style="color: #859900; font-weight: bold;">;</span>

<span style="color: #268bd2;">A</span> = blisterwort
<span style="color: #268bd2;">B</span> = blue_mountain_flower ? <span style="color: #859900; font-weight: bold;">;</span>
</pre>
</div>

<p>
…and so on.
</p>

<p>
Maybe we have some wheat on hand, what can we combine it with?
</p>

<div class="org-src-container">

<pre class="src src-prolog"><span style="color: #859900; font-weight: bold;">|</span> ?- potion<span style="color: #f5deb3;">(</span> wheat, <span style="color: #268bd2;">Ingredient</span>, <span style="color: #268bd2;">Effect</span> <span style="color: #f5deb3;">)</span>.

<span style="color: #268bd2;">Effect</span> = damage_stamina_regen
<span style="color: #268bd2;">Ingredient</span> = creep_cluster ? <span style="color: #859900; font-weight: bold;">;</span>

<span style="color: #268bd2;">Effect</span> = damage_stamina_regen
<span style="color: #268bd2;">Ingredient</span> = daedra_heart ? <span style="color: #859900; font-weight: bold;">;</span>

<span style="color: #268bd2;">Effect</span> = damage_stamina_regen
<span style="color: #268bd2;">Ingredient</span> = frost_mirriam ? <span style="color: #859900; font-weight: bold;">;</span>

<span style="color: #268bd2;">Effect</span> = damage_stamina_regen
<span style="color: #268bd2;">Ingredient</span> = giants_toe ? <span style="color: #859900; font-weight: bold;">;</span>

<span style="color: #268bd2;">Effect</span> = damage_stamina_regen
<span style="color: #268bd2;">Ingredient</span> = histcarp ?

yes
<span style="color: #859900; font-weight: bold;">|</span> ?-
</pre>
</div>

<p>
I've got a bunch of ingredients, what can I make and sell?
</p>

<div class="org-src-container">

<pre class="src src-prolog"><span style="color: #859900; font-weight: bold;">|</span> ?- mixes<span style="color: #f5deb3;">(</span> <span style="color: #b58900; font-weight: bold;">[</span>wheat, vampire_dust, daedra_heart, troll_fat<span style="color: #b58900; font-weight: bold;">]</span>, <span style="color: #268bd2;">A</span>, <span style="color: #268bd2;">B</span>, <span style="color: #268bd2;">E</span> <span style="color: #f5deb3;">)</span>.

<span style="color: #268bd2;">A</span> = wheat
<span style="color: #268bd2;">B</span> = daedra_heart
<span style="color: #268bd2;">E</span> = damage_stamina_regen ? <span style="color: #859900; font-weight: bold;">;</span>

<span style="color: #268bd2;">A</span> = wheat
<span style="color: #268bd2;">B</span> = daedra_heart
<span style="color: #268bd2;">E</span> = restore_health ?

yes
</pre>
</div>

<p>
Another way to get ingredients for a particular potion:
</p>

<div class="org-src-container">

<pre class="src src-prolog"><span style="color: #859900; font-weight: bold;">|</span> ?- mixes<span style="color: #f5deb3;">(</span> <span style="color: #268bd2;">L</span>, <span style="color: #268bd2;">_</span>, <span style="color: #268bd2;">_</span>, restore_health <span style="color: #f5deb3;">)</span>.

<span style="color: #268bd2;">L</span> = <span style="color: #f5deb3; font-weight: bold;">[</span>blisterwort,blue_dartwing<span style="color: #f5deb3; font-weight: bold;">]</span> ? <span style="color: #859900; font-weight: bold;">;</span>

<span style="color: #268bd2;">L</span> = <span style="color: #f5deb3; font-weight: bold;">[</span>blisterwort,blue_mountain_flower<span style="color: #f5deb3; font-weight: bold;">]</span> ?

yes
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Haskell</h3>
<div class="outline-text-3" id="text-1-2">
<p>
In haskell, we can use list-comprehensions to perform similar sorts of searches.
</p>
</div>
