alchemy.html

<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">Facts</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #859900; font-weight: bold;">module</span> <span style="color: #b58900;">AlchemyFacts</span> <span style="color: #859900; font-weight: bold;">where</span>

<span style="color: #859900; font-weight: bold;">type</span> <span style="color: #b58900;">Ingredient</span> <span style="color: #268bd2;">=</span> <span style="color: #b58900;">String</span>
<span style="color: #859900; font-weight: bold;">type</span> <span style="color: #b58900;">Effect</span>     <span style="color: #268bd2;">=</span> <span style="color: #b58900;">String</span>
<span style="color: #859900; font-weight: bold;">type</span> <span style="color: #b58900;">Property</span>   <span style="color: #268bd2;">=</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Ingredient</span>, <span style="color: #b58900;">Effect</span><span style="color: #f5deb3;">)</span>

<span style="color: #859900; font-weight: bold;">type</span> <span style="color: #b58900;">Facts</span> <span style="color: #268bd2;">=</span> <span style="color: #f5deb3;">[</span><span style="color: #b58900;">Property</span><span style="color: #f5deb3;">]</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #268bd2;">facts</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Facts</span>
<span style="color: #268bd2;">facts</span> <span style="color: #268bd2;">=</span> <span style="color: #f5deb3;">[</span>
  <span style="color: #b58900;">(</span><span style="color: #2aa198;">"Abecean Longfin"</span>, <span style="color: #2aa198;">"Fortify Restoration"</span><span style="color: #b58900;">)</span>,
  <span style="color: #b58900;">(</span><span style="color: #2aa198;">"Abecean Longfin"</span>, <span style="color: #2aa198;">"Fortify Sneak"</span><span style="color: #b58900;">)</span>,
  <span style="color: #b58900;">(</span><span style="color: #2aa198;">"Abecean Longfin"</span>, <span style="color: #2aa198;">"Weakness To Frost"</span><span style="color: #b58900;">)</span>,
  <span style="color: #b58900;">(</span><span style="color: #2aa198;">"Abecean Longfin"</span>, <span style="color: #2aa198;">"Weakness To Poison"</span><span style="color: #b58900;">)</span>,

  <span style="color: #b58900;">(</span><span style="color: #2aa198;">"Ancestor Moth Wing"</span>, <span style="color: #2aa198;">"Damage Magicka Regen"</span><span style="color: #b58900;">)</span>,
  <span style="color: #b58900;">(</span><span style="color: #2aa198;">"Ancestor Moth Wing"</span>, <span style="color: #2aa198;">"Damage Stamina"</span><span style="color: #b58900;">)</span>,
  <span style="color: #b58900;">(</span><span style="color: #2aa198;">"Ancestor Moth Wing"</span>, <span style="color: #2aa198;">"Fortify Conjuration"</span><span style="color: #b58900;">)</span>,
  <span style="color: #b58900;">(</span><span style="color: #2aa198;">"Ancestor Moth Wing"</span>, <span style="color: #2aa198;">"Fortify Enchanting"</span><span style="color: #b58900;">)</span>,

  <span style="color: #b58900;">(</span><span style="color: #2aa198;">"Bear Claws"</span>, <span style="color: #2aa198;">"Damage Magicka Regen"</span><span style="color: #b58900;">)</span>,
  <span style="color: #b58900;">(</span><span style="color: #2aa198;">"Bear Claws"</span>, <span style="color: #2aa198;">"Fortify Health"</span><span style="color: #b58900;">)</span>,
  <span style="color: #b58900;">(</span><span style="color: #2aa198;">"Bear Claws"</span>, <span style="color: #2aa198;">"Fortify One Handed"</span><span style="color: #b58900;">)</span>,
  <span style="color: #b58900;">(</span><span style="color: #2aa198;">"Bear Claws"</span>, <span style="color: #2aa198;">"Restore Stamina"</span><span style="color: #b58900;">)</span>,
  <span style="color: #586e75;">-- </span><span style="color: #586e75;">&#8230;</span>
</pre>
</div>

<p>
To check if two ingredients can mix:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #859900; font-weight: bold;">module</span> <span style="color: #b58900;">Alchemy</span> <span style="color: #859900; font-weight: bold;">where</span>
<span style="color: #859900; font-weight: bold;">import</span> <span style="color: #b58900;">Data.List</span>  <span style="color: #586e75;">-- </span><span style="color: #586e75;">for nub (unique list)</span>
<span style="color: #859900; font-weight: bold;">import</span> <span style="color: #b58900;">AlchemyFacts</span>

<span style="color: #268bd2;">ingredients</span> <span style="color: #268bd2;">=</span> nub <span style="color: #f5deb3;">[</span>i <span style="color: #268bd2;">|</span> <span style="color: #b58900;">(</span>i, <span style="color: #859900; font-weight: bold;">_</span><span style="color: #b58900;">)</span> <span style="color: #268bd2;">&lt;-</span> facts<span style="color: #f5deb3;">]</span>
<span style="color: #268bd2;">effects</span>     <span style="color: #268bd2;">=</span> nub <span style="color: #f5deb3;">[</span>e <span style="color: #268bd2;">|</span> <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">_</span>, e<span style="color: #b58900;">)</span> <span style="color: #268bd2;">&lt;-</span> facts<span style="color: #f5deb3;">]</span>

<span style="color: #268bd2;">potion</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Ingredient</span> <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Ingredient</span> <span style="color: #268bd2;">-&gt;</span> <span style="color: #f5deb3;">[</span><span style="color: #b58900;">Effect</span><span style="color: #f5deb3;">]</span>
<span style="color: #268bd2;">potion</span> a b <span style="color: #268bd2;">=</span> <span style="color: #f5deb3;">[</span>e <span style="color: #268bd2;">|</span>
              <span style="color: #b58900;">(</span>i, e<span style="color: #b58900;">)</span> <span style="color: #268bd2;">&lt;-</span> facts,
              <span style="color: #b58900;">(</span>i', e'<span style="color: #b58900;">)</span> <span style="color: #268bd2;">&lt;-</span> facts,
              e <span style="color: #268bd2;">==</span> e',
              i <span style="color: #268bd2;">==</span> a,
              i' <span style="color: #268bd2;">==</span> b<span style="color: #f5deb3;">]</span>
</pre>
</div>

<p>
The interface for this function is a bit different than the Prolog
implementation in that it returns list of <code>Effects</code>.
</p>

<p>
Running this code in GHCi, I get:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #b58900;">GHCi</span>, version 7<span style="color: #268bd2;">.</span>4<span style="color: #268bd2;">.</span>1<span style="color: #b58900;">:</span> http<span style="color: #b58900;">://</span>www<span style="color: #268bd2;">.</span>haskell<span style="color: #268bd2;">.</span>org<span style="color: #268bd2;">/</span>ghc<span style="color: #268bd2;">/</span>  <span style="color: #b58900;">:?</span> for help
<span style="color: #b58900;">Prelude</span><span style="color: #268bd2;">&gt;</span> <span style="color: #b58900;">:</span>load alchemy
<span style="color: #f5deb3;">[</span>1 <span style="color: #859900; font-weight: bold;">of</span> 2<span style="color: #f5deb3;">]</span> <span style="color: #b58900;">Compiling</span> <span style="color: #b58900;">AlchemyFacts</span>     <span style="color: #f5deb3;">(</span> <span style="color: #DADADA; background-color: #211E1E;">AlchemyFacts.hs</span>, interpreted <span style="color: #f5deb3;">)</span>
<span style="color: #f5deb3;">[</span>2 <span style="color: #859900; font-weight: bold;">of</span> 2<span style="color: #f5deb3;">]</span> <span style="color: #b58900;">Compiling</span> <span style="color: #b58900;">Alchemy</span>          <span style="color: #f5deb3;">(</span> alchemy<span style="color: #268bd2;">.</span>hs, interpreted <span style="color: #f5deb3;">)</span>
<span style="color: #b58900;">Ok</span>, modules loaded<span style="color: #b58900;">:</span> <span style="color: #b58900;">AlchemyFacts</span>, <span style="color: #b58900;">Alchemy</span><span style="color: #268bd2;">.</span>
<span style="color: #268bd2;">*</span><span style="color: #b58900;">Alchemy</span><span style="color: #268bd2;">&gt;</span> <span style="color: #b58900;">:</span>t ingredients
<span style="color: #268bd2;">ingredients</span> <span style="color: #268bd2;">::</span> <span style="color: #f5deb3;">[</span><span style="color: #b58900;">Ingredient</span><span style="color: #f5deb3;">]</span>
<span style="color: #268bd2;">*</span><span style="color: #b58900;">Alchemy</span><span style="color: #268bd2;">&gt;</span> <span style="color: #b58900;">:</span>t effects
<span style="color: #268bd2;">effects</span> <span style="color: #268bd2;">::</span> <span style="color: #f5deb3;">[</span><span style="color: #b58900;">Effect</span><span style="color: #f5deb3;">]</span>
<span style="color: #268bd2;">*</span><span style="color: #b58900;">Alchemy</span><span style="color: #268bd2;">&gt;</span> potion <span style="color: #2aa198;">"Wheat"</span> <span style="color: #2aa198;">"Daedra Heart"</span>
<span style="color: #f5deb3;">[</span><span style="color: #2aa198;">"Damage Stamina Regen"</span>,<span style="color: #2aa198;">"Restore Health"</span><span style="color: #f5deb3;">]</span>
</pre>
</div>

<p>
In Haskell, unlike Prolog, we don't get automatic reverse
execution.  So, we'll need another function to search for
ingredients with a given <code>Effect</code>.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #268bd2;">withEffect</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Effect</span> <span style="color: #268bd2;">-&gt;</span> <span style="color: #f5deb3;">[</span><span style="color: #b58900;">Ingredient</span><span style="color: #f5deb3;">]</span>
<span style="color: #268bd2;">withEffect</span> e <span style="color: #268bd2;">=</span> nub <span style="color: #f5deb3;">[</span>i <span style="color: #268bd2;">|</span> <span style="color: #b58900;">(</span>i, e'<span style="color: #b58900;">)</span> <span style="color: #268bd2;">&lt;-</span> facts, e <span style="color: #268bd2;">==</span> e'<span style="color: #f5deb3;">]</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #268bd2;">*</span><span style="color: #b58900;">Alchemy</span><span style="color: #268bd2;">&gt;</span> withEffect <span style="color: #2aa198;">"Frenzy"</span>
<span style="color: #f5deb3;">[</span><span style="color: #2aa198;">"Blisterwort"</span>,<span style="color: #2aa198;">"Falmer Ear"</span>,<span style="color: #2aa198;">"Fly Amanita"</span>,<span style="color: #2aa198;">"Hagraven Feathers"</span>,<span style="color: #2aa198;">"Human Heart"</span>,<span style="color: #2aa198;">"Troll Fat"</span><span style="color: #f5deb3;">]</span>
</pre>
</div>
</div>
</div>
</div>
</div>
